moa2ofo/mcu/test/UnitTestResults/CANTRX_setCANTRXIntNodePtrResults/test/mocks/test_CANTRX_setCANTRXIntNodePtr_1/mock_tle989x.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_TLE989X_H
#define _MOCK_TLE989X_H

#include "unity.h"
#include "tle989x.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

#ifdef __cplusplus
extern "C" {
#endif

void mock_tle989x_Init(void);
void mock_tle989x_Destroy(void);
void mock_tle989x_Verify(void);





#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
